
export class LoggingService {
    logStatusChange(status: string) {
        console.log('A server status changed, new status: ' + status);
    }
}


/*
dependency Injection - внедрения сервиса в компоненту
ієрархічний інджектор 
Appmodule-якщо ми там запровайдим то сервіс буде доступним повсюди
AppComponent-всі компоненти будуть мати один і той самий інстанс(але не інші сервіси)
Any other component -якщо компонента має дитячі компоненти то той самий інстанс будуть мати вони тоже

тобто якщо ми заінжектили сервіс вище і створили знову інстанс сервіса компонентою нижче тоді в компоненті 
нижче інстанс перезапишеться
*/ 